# Esercizio 1
Dal database AdventureWorks estraiamo la tabella dimproduct 
- Sulla colonna DealerPrice, utilizzando il metodo .round(), arrotondiamo i valori alle due cifre decimali, e poi al valore intero più vicino
-  Utilizzando il metodo .clip(), facciamo in modo che i valori siano compresi tra un minimo di 0 e un massimo di 1000

In [51]:
from pathlib import Path
import pandas as pd
import numpy as np
import os

parent_folder = str(Path(os.path.abspath("")).parents[0]) + '\\'
path = parent_folder + "adventureworks_connection.ipynb"

%run {path}

connected

In [ ]:
adw_dimproduct = pd.read_sql('SELECT * FROM dimproduct', db_engine)

print('adw_dimproduct shape:', adw_dimproduct.shape)
print('adw_dimproduct columns:', adw_dimproduct.columns)

In [ ]:
adw_dimproduct['DealerPrice'].round(2).round(0)#.dropna().astype(int)

In [ ]:
display(adw_dimproduct['DealerPrice'].describe())
adw_dimproduct['DealerPrice'] = adw_dimproduct['DealerPrice'].clip(0, 1000)
print('\n')
display(adw_dimproduct['DealerPrice'].describe())

# Esercizio 2
Creiamo un DataFrame sintetico, che contiene i guadagni mensili di diverse annate, con il seguente codice: 

```python 
years = 5
a = pd.DataFrame({"Mese": list("GFMAMGLASOND"*years), "Anno": np.repeat(list(range(years)), 12), "Guadagni": np.random.randint(800, 5000, 12*years)})
```

- Calcola la somma cumulativa delle vendite per ogni mese utilizzando il metodo .cumsum()
- Come sopra, ma raggruppato per ogni anno usando prima un .groupby()

In [ ]:
years = 5
a = pd.DataFrame({"Mese": list("GFMAMGLASOND"*years), "Anno": np.repeat(list(range(years)), 12), "Guadagni": np.random.randint(800, 5000, 12*years)})

a.cumsum()

In [ ]:
a['year_cumsum'] = a.groupby('Anno').Guadagni.cumsum()
a

# Esercizio 3 1/2 
Dal database AdventureWorks estraiamo la tabella dimcustomer 
- Trasformiamo i nomi dei clienti in modo che abbiano solo lettere minuscole, e i cognomi in modo che abbiano solo lettere maiuscole
- Sulla colonna EmailAddress, utilizzando il metodo .str.split(), estraiamo nome utente e dominio
- Sulla colonna Phone, estraiamo ogni parte del numero (ad es. da "1 (11) 500 555-0162" a ["1", "(11)", "500", "555-0162"])
- Utilizzando il metodo .str.contains(), estraiamo tutti gli indirizzi e-mail che contengono il numero "21"

In [398]:
adw_dimcustomer = pd.read_sql('SELECT * FROM dimcustomer', db_engine)

print('adw_dimcustomer shape:', adw_dimcustomer.shape)
print('adw_dimcustomer columns:', adw_dimcustomer.columns)

adw_dimcustomer shape: (18484, 29)
adw_dimcustomer columns: Index(['CustomerKey', 'GeographyKey', 'CustomerAlternateKey', 'Title',
       'FirstName', 'MiddleName', 'LastName', 'NameStyle', 'BirthDate',
       'MaritalStatus', 'Suffix', 'Gender', 'EmailAddress', 'YearlyIncome',
       'TotalChildren', 'NumberChildrenAtHome', 'EnglishEducation',
       'SpanishEducation', 'FrenchEducation', 'EnglishOccupation',
       'SpanishOccupation', 'FrenchOccupation', 'HouseOwnerFlag',
       'NumberCarsOwned', 'AddressLine1', 'AddressLine2', 'Phone',
       'DateFirstPurchase', 'CommuteDistance'],
      dtype='object')

In [399]:
adw_dimcustomer.FirstName = adw_dimcustomer.FirstName.str.lower()
adw_dimcustomer.LastName = adw_dimcustomer.LastName.str.upper()
adw_dimcustomer[['FirstName','LastName']]

       FirstName LastName
0            jon     YANG
1         eugene    HUANG
2          ruben   TORRES
3        christy      ZHU
4      elizabeth  JOHNSON
...          ...      ...
18479      tommy     TANG
18480       nina     RAJI
18481       ivan     SURI
18482    clayton    ZHANG
18483      jésus  NAVARRO

[18484 rows x 2 columns]

In [400]:
adw_dimcustomer.EmailAddress.str.split('@')

0             [jon24, adventure-works.com]
1          [eugene10, adventure-works.com]
2           [ruben35, adventure-works.com]
3         [christy12, adventure-works.com]
4        [elizabeth5, adventure-works.com]
                       ...
18479        [tommy2, adventure-works.com]
18480        [nina21, adventure-works.com]
18481         [ivan0, adventure-works.com]
18482      [clayton0, adventure-works.com]
18483        [jésus9, adventure-works.com]
Name: EmailAddress, Length: 18484, dtype: object

In [419]:
adw_dimcustomer.EmailAddress.str.split('@', expand = True).iloc[:,0]

0             jon24
1          eugene10
2           ruben35
3         christy12
4        elizabeth5
            ...
18479        tommy2
18480        nina21
18481         ivan0
18482      clayton0
18483        jésus9
Name: 0, Length: 18484, dtype: object

In [401]:
adw_dimcustomer.Phone.str.split(' ')

0        [1, (11), 500, 555-0162]
1        [1, (11), 500, 555-0110]
2        [1, (11), 500, 555-0184]
3        [1, (11), 500, 555-0162]
4        [1, (11), 500, 555-0131]
                   ...
18479    [1, (11), 500, 555-0136]
18480    [1, (11), 500, 555-0146]
18481    [1, (11), 500, 555-0144]
18482    [1, (11), 500, 555-0137]
18483    [1, (11), 500, 555-0141]
Name: Phone, Length: 18484, dtype: object

In [402]:
email_flt = adw_dimcustomer.EmailAddress.str.contains('21')
adw_dimcustomer.EmailAddress[ email_flt ]

64          chase21@adventure-works.com
118         alvin21@adventure-works.com
130      caroline21@adventure-works.com
163       gabriel21@adventure-works.com
203          luis21@adventure-works.com
                      ...
18337      hector21@adventure-works.com
18365      cheryl21@adventure-works.com
18435     stanley21@adventure-works.com
18440      rafael21@adventure-works.com
18480        nina21@adventure-works.com
Name: EmailAddress, Length: 431, dtype: object

# Esercizio 3 2/2 
- Estraiamo tutti gli indirizzi e-mail che contengono il numero "20" oppure il numero "10"
- Calcolare la lunghezza di ogni indirizzo e-mail ed estrarre i dieci più lunghi e i dieci più corti
- Modificare il dominio degli indirizzi e-mail da "adventure-works.com" a "aw-db.com" mediante il metodo .str.replace()
- Dalla colonna AddressLine1 estraiamo tutti gli indirizzi che contengono la sottostringa "Street"

In [411]:
email_flt_20 = adw_dimcustomer.EmailAddress.str.contains('20')
email_flt_10 = adw_dimcustomer.EmailAddress.str.contains('10')

adw_dimcustomer.EmailAddress[ email_flt_20 | email_flt_10 ]

1            eugene10@adventure-works.com
10        jacquelyn20@adventure-works.com
22            ethan20@adventure-works.com
30          bethany10@adventure-works.com
32           denise10@adventure-works.com
                       ...
18395         lydia10@adventure-works.com
18397        walter10@adventure-works.com
18415         oscar20@adventure-works.com
18418       lindsey10@adventure-works.com
18428    kristopher20@adventure-works.com
Name: EmailAddress, Length: 1042, dtype: object

In [412]:
adw_dimcustomer.EmailAddress.str.len()

0        25
1        28
2        27
3        29
4        30
         ..
18479    26
18480    26
18481    25
18482    28
18483    26
Name: EmailAddress, Length: 18484, dtype: int64

In [413]:
adw_dimcustomer.EmailAddress.sort_values()[:10]

15694    aaron10@adventure-works.com
3617     aaron11@adventure-works.com
13649    aaron12@adventure-works.com
10414    aaron13@adventure-works.com
2891     aaron14@adventure-works.com
4566     aaron15@adventure-works.com
7804     aaron16@adventure-works.com
1067     aaron17@adventure-works.com
9285     aaron18@adventure-works.com
14599    aaron19@adventure-works.com
Name: EmailAddress, dtype: object

In [414]:
adw_dimcustomer.EmailAddress.sort_values()[-10:]

10443    zoe21@adventure-works.com
3396     zoe22@adventure-works.com
12123     zoe2@adventure-works.com
13825     zoe3@adventure-works.com
2978      zoe4@adventure-works.com
12482     zoe5@adventure-works.com
710       zoe6@adventure-works.com
3611      zoe7@adventure-works.com
8900      zoe8@adventure-works.com
6755      zoe9@adventure-works.com
Name: EmailAddress, dtype: object

In [415]:
adw_dimcustomer.EmailAddress = adw_dimcustomer.EmailAddress.str.replace("adventure-works.com", "aw-db.com")
adw_dimcustomer.EmailAddress

0             jon24@aw-db.com
1          eugene10@aw-db.com
2           ruben35@aw-db.com
3         christy12@aw-db.com
4        elizabeth5@aw-db.com
                 ...
18479        tommy2@aw-db.com
18480        nina21@aw-db.com
18481         ivan0@aw-db.com
18482      clayton0@aw-db.com
18483        jésus9@aw-db.com
Name: EmailAddress, Length: 18484, dtype: object

In [416]:
adw_dimcustomer.AddressLine1[ adw_dimcustomer.AddressLine1.str.contains("Street") ]

7              942 Brook Street
12            4785 Scott Street
32           626 Bentley Street
63           4927 Virgil Street
125          8481 Zartop Street
                  ...
18273        2155 Zartop Street
18292         3931 Scott Street
18323    134 Peachwillow Street
18333       1023 Hawkins Street
18351          8618 Rose Street
Name: AddressLine1, Length: 512, dtype: object

# Esercizio 4 1/2 
Dai beginner_datasets carichiamo in un DataFrame il file facebook.csv, che contiene dei post con data di pubblicazione, tipo (foto, video, …) e numero di reactions raccolte: 
- Con la funzione pd.to_datetime() convertiamo la colonna status_published in formato Timestamp
- Utilizzando gli attributi .dt.year , .dt.month , .dt.day , .dt.dayofweek , .dt.dayofyear, ottieniamo informazioni specifiche sulle date delle transazioni, come l'anno, il mese, il giorno della settimana, il giorno dell'anno, eccetera

In [4]:
facebook_df = pd.read_csv(parent_folder + 'datasets/beginner_datasets/facebook.csv')

facebook_df

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
0,246675545449582_1649696485147474,video,4/22/2018 6:00,529,512,262,432,92,3,1,1,0
1,246675545449582_1649426988507757,photo,4/21/2018 22:45,150,0,0,150,0,0,0,0,0
2,246675545449582_1648730588577397,video,4/21/2018 6:17,227,236,57,204,21,1,1,0,0
3,246675545449582_1648576705259452,photo,4/21/2018 2:29,111,0,0,111,0,0,0,0,0
4,246675545449582_1645700502213739,photo,4/18/2018 3:22,213,0,0,204,9,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
7045,1050855161656896_1061863470556065,photo,9/24/2016 2:58,89,0,0,89,0,0,0,0,0
7046,1050855161656896_1061334757275603,photo,9/23/2016 11:19,16,0,0,14,1,0,1,0,0
7047,1050855161656896_1060126464063099,photo,9/21/2016 23:03,2,0,0,1,1,0,0,0,0
7048,1050855161656896_1058663487542730,photo,9/20/2016 0:43,351,12,22,349,2,0,0,0,0
7049,1050855161656896_1050858841656528,photo,9/10/2016 10:30,17,0,0,17,0,0,0,0,0

In [423]:
facebook_df['status_published'] = pd.to_datetime(facebook_df['status_published'])
facebook_df['status_published']

0      2018-04-22 06:00:00
1      2018-04-21 22:45:00
2      2018-04-21 06:17:00
3      2018-04-21 02:29:00
4      2018-04-18 03:22:00
               ...
7045   2016-09-24 02:58:00
7046   2016-09-23 11:19:00
7047   2016-09-21 23:03:00
7048   2016-09-20 00:43:00
7049   2016-09-10 10:30:00
Name: status_published, Length: 7050, dtype: datetime64[ns]

In [424]:
months_group = facebook_df['status_published'].dt.month
facebook_df['status_published'].groupby(months_group).count().sort_values()

status_published
7     347
10    485
9     486
8     499
2     513
1     585
6     604
4     635
3     666
11    674
5     733
12    823
Name: status_published, dtype: int64

In [425]:
years_group = facebook_df['status_published'].dt.year
facebook_df['status_published'].groupby(years_group).count().sort_values()

status_published
2014     233
2015     337
2013     500
2016     588
2012     589
2017    2253
2018    2550
Name: status_published, dtype: int64

In [426]:
days_group = facebook_df['status_published'].dt.day
facebook_df['status_published'].groupby(days_group).count().sort_values()

status_published
31    121
14    169
30    182
4     201
13    204
1     209
29    214
3     215
17    216
7     220
28    220
15    223
12    226
16    227
19    229
6     229
27    231
2     232
11    236
21    238
18    238
26    242
10    243
23    243
22    245
5     260
24    262
9     262
20    263
25    269
8     281
Name: status_published, dtype: int64

In [427]:
daysofweek_group = facebook_df['status_published'].dt.dayofweek
facebook_df['status_published'].groupby(daysofweek_group).count().sort_values()

status_published
2     981
5     982
3     983
0     994
4    1010
1    1041
6    1059
Name: status_published, dtype: int64

In [428]:
daysofyear_group = facebook_df['status_published'].dt.dayofyear
facebook_df['status_published'].groupby(daysofyear_group).count().sort_values()

status_published
366     1
182     3
170     3
1       3
183     4
       ..
145    42
159    45
162    46
160    47
158    57
Name: status_published, Length: 366, dtype: int64

# Esercizio 4 2/2 
- Estraiamo solo i post relativi al 2012
- Estraiamo solo i post relativi a maggio 2018
- Confrontiamo il numero di post pubblicati nei weekend rispetto al numero di post pubblicati nel resto della settimana
- Troviamo il primo e ultimo post pubblicati in ogni anno
- Quanti tipi di post ci sono? E quanti per ogni tipo?

In [ ]:
post_year_flt = facebook_df['status_published'].dt.year == 2012

facebook_df[ post_year_flt ].sample(5)

In [430]:
post_year_flt = facebook_df['status_published'].dt.year == 2018
post_month_flt = facebook_df['status_published'].dt.month == 5

facebook_df[ post_year_flt & post_month_flt ]

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
2690,134115277150304_264554297439734,photo,2018-05-31 12:17:00,11,0,0,10,0,1,0,0,0
2691,134115277150304_264493694112461,photo,2018-05-31 08:37:00,56,4,2,55,1,0,0,0,0
2692,134115277150304_264416247453539,photo,2018-05-31 03:12:00,72,13,1,69,3,0,0,0,0
2693,134115277150304_264168277478336,photo,2018-05-30 08:46:00,10,0,0,10,0,0,0,0,0
2694,134115277150304_264160757479088,photo,2018-05-30 08:24:00,56,3,12,54,2,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...
6339,1050855161656896_1615666458509094,link,2018-05-04 01:27:00,12,7,7,12,0,0,0,0,0
6340,1050855161656896_1614717551937318,photo,2018-05-03 01:15:00,63,21,1,62,1,0,0,0,0
6341,1050855161656896_1614187798656960,photo,2018-05-02 12:17:00,218,105,153,212,2,4,0,0,0
6342,1050855161656896_1613063202102753,video,2018-05-01 08:38:00,246,2373,475,108,130,5,2,1,0
6343,1050855161656896_1612778858797854,photo,2018-05-01 01:18:00,34,5,0,33,1,0,0,0,0

In [431]:
post_weekdays_flt = facebook_df['status_published'].dt.dayofweek < 5
post_weekend_flt = facebook_df['status_published'].dt.dayofweek >= 5

print('numero di post nel weekend: ', facebook_df[ post_weekend_flt ].shape[0])
print('numero di post negli altri giorni: ', facebook_df[ post_weekdays_flt ].shape[0])

numero di post nel weekend:  2041
numero di post negli altri giorni:  5009

In [441]:
post_year = facebook_df['status_published'].dt.year

for year in post_year.unique():
    facebook_df_year = facebook_df.groupby(post_year).get_group(year).sort_values('status_published')
    print(year)
    display('Primo post per ogni anno:', facebook_df_year.head(1))
    display('Ultimo post per ogni anno:', facebook_df_year.tail(1))

2018

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
3264,134115277150304_211295932765571,video,2018-01-01 01:39:00,296,869,58,252,39,2,2,1,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
4730,614855718638584_855501374574016,photo,2018-06-13 01:12:00,2,0,0,2,0,0,0,0,0

2017

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
434,246675545449582_1159059407544520,photo,2017-01-02 08:25:00,254,5,0,252,2,0,0,0,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
3265,134115277150304_211240079437823,photo,2017-12-31 22:15:00,45,2,0,45,0,0,0,0,0

2016

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
975,246675545449582_868621673254963,photo,2016-01-03 04:23:00,21,2,0,21,0,0,0,0,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
435,246675545449582_1157109567739504,photo,2016-12-31 05:13:00,304,9,6,298,5,1,0,0,0

2015

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
1312,246675545449582_682315955218870,video,2015-01-02 03:41:00,1294,23,47,1294,0,0,0,0,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
976,246675545449582_867129116737552,photo,2015-12-31 08:20:00,318,7,1,318,0,0,0,0,0

2014

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
1545,246675545449582_486434424807025,video,2014-01-05 09:23:00,460,31,1,460,0,0,0,0,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
1313,246675545449582_668776289906170,video,2014-12-10 07:42:00,1501,113,38,1501,0,0,0,0,0

2013

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
2045,246675545449582_307286656055137,photo,2013-01-02 02:23:00,25,3,1,25,0,0,0,0,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
1546,246675545449582_484017401715394,video,2013-12-31 23:38:00,100,0,0,100,0,0,0,0,0

2012

'Primo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
2634,246675545449582_246677465449390,photo,2012-07-15 02:51:00,15,3,0,15,0,0,0,0,0

'Ultimo post per ogni anno:'

,status_id,status_type,status_published,num_reactions,num_comments,num_shares,num_likes,num_loves,num_wows,num_hahas,num_sads,num_angrys
2046,246675545449582_303160673134402,photo,2012-12-23 03:11:00,0,0,0,0,0,0,0,0,0

In [442]:
print('Tipi di post:', facebook_df['status_type'].unique(), '\tnum:', facebook_df['status_type'].nunique())
print(facebook_df.groupby('status_type').status_type.count())

Tipi di post: ['video' 'photo' 'link' 'status'] 	num: 4
status_type
link        63
photo     4288
status     365
video     2334
Name: status_type, dtype: int64

# Esercizio 5
Dai beginner_dataset carichiamo in un DataFrame il file pokemon.csv: 
- Tramite i metodi .isnull() e .sum() controlliamo se ci sono valori nulli nel dataset e contiamo quanti valori nulli ci sono in ogni colonna
- Ci sono valori nulli?
- Se sì, avrebbe senso cercare di riempirli?
- Eliminiamo le righe che contengono valori nulli

In [8]:
pokemon_df = pd.read_csv(parent_folder + 'datasets/beginner_datasets/pokemon.csv')

pokemon_df

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [12]:
pokemon_df.isnull().sum()

#               0
Name            0
Type 1          0
Type 2        386
Total           0
HP              0
Attack          0
Defense         0
Sp. Atk         0
Sp. Def         0
Speed           0
Generation      0
Legendary       0
dtype: int64

In [15]:
pokemon_df = pokemon_df.dropna()
pokemon_df

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
6,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,719,Diancie,Rock,Fairy,600,50,100,150,100,150,50,6,True
796,719,DiancieMega Diancie,Rock,Fairy,700,50,160,110,160,110,110,6,True
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

# Esercizio 6
Dai beginner_dataset carichiamo in un DataFrame il file automobile.csv: 
- Ci sono valori nulli? Dove? Quanti?
- Quali righe hanno un valore nullo nella colonna num-of-doors?
- Esaminando i dati nel dataset, cerchiamo una logica per sostituire i valori nulli nella colonna num-of-doors

In [112]:
automobile_df = pd.read_csv(parent_folder + 'datasets/beginner_datasets/automobile.csv')

automobile_df

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164.0,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164.0,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
197,-1,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
198,-1,95.0,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95.0,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.4,23.0,106,4800,26,27,22470
200,-1,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625
201,-1,95.0,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [113]:
automobile_df.isna().sum()

symboling             0
normalized-losses    37
make                  0
fuel-type             0
aspiration            0
num-of-doors          2
body-style            0
drive-wheels          0
engine-location       0
wheel-base            0
length                0
width                 0
height                0
curb-weight           0
engine-type           0
num-of-cylinders      0
engine-size           0
fuel-system           0
bore                  0
stroke                0
compression-ratio     0
horsepower            0
peak-rpm              0
city-mpg              0
highway-mpg           0
price                 0
dtype: int64

In [142]:
num_doors_null_flt = automobile_df[ 'num-of-doors' ].isnull()
print('Righe dove num-of-doors è null')
automobile_df[ num_doors_null_flt ]

Righe dove num-of-doors è null

Empty DataFrame
Columns: [symboling, normalized-losses, make, fuel-type, aspiration, num-of-doors, body-style, drive-wheels, engine-location, wheel-base, length, width, height, curb-weight, engine-type, num-of-cylinders, engine-size, fuel-system, bore, stroke, compression-ratio, horsepower, peak-rpm, city-mpg, highway-mpg, price]
Index: []

[0 rows x 26 columns]

In [115]:
sedan = automobile_df['body-style'] == 'sedan'
doors = automobile_df['num-of-doors'] == 'two'
print('Per le berline a 2 porte, aspiration è \'std\'')
display(automobile_df[ sedan & doors ])

aspiration è 'std' per le berline a due porte

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
5,2,NaN,audi,gas,std,two,sedan,fwd,front,99.8,...,136,mpfi,3.19,3.4,8.5,110,5500,19,25,15250
9,2,192.0,bmw,gas,std,two,sedan,rwd,front,101.2,...,108,mpfi,3.5,2.8,8.8,101,5800,23,29,16430
11,0,188.0,bmw,gas,std,two,sedan,rwd,front,101.2,...,164,mpfi,3.31,3.19,9.0,121,4250,21,28,20970
15,0,NaN,bmw,gas,std,two,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,41315
41,1,107.0,honda,gas,std,two,sedan,fwd,front,96.5,...,110,2bbl,3.15,3.58,9.1,100,5500,25,31,10345
46,0,NaN,jaguar,gas,std,two,sedan,rwd,front,102.0,...,326,mpfi,3.54,2.76,11.5,262,5000,13,17,36000
86,1,128.0,nissan,gas,std,two,sedan,fwd,front,94.5,...,97,2bbl,3.15,3.29,9.4,69,5200,31,37,5499
87,1,128.0,nissan,diesel,std,two,sedan,fwd,front,94.5,...,103,idi,2.99,3.47,21.9,55,4800,45,50,7099
88,1,128.0,nissan,gas,std,two,sedan,fwd,front,94.5,...,97,2bbl,3.15,3.29,9.4,69,5200,31,37,6649
91,1,128.0,nissan,gas,std,two,sedan,fwd,front,94.5,...,97,2bbl,3.15,3.29,9.4,69,5200,31,37,7299
159,1,168.0,toyota,gas,std,two,sedan,rwd,front,94.5,...,98,2bbl,3.19,3.03,9.0,70,4800,29,34,8058
161,1,168.0,toyota,gas,std,two,sedan,rwd,front,94.5,...,98,mpfi,3.24,3.08,9.4,112,6600,26,29,9298
178,2,122.0,volkswagen,diesel,std,two,sedan,fwd,front,97.3,...,97,idi,3.01,3.4,23.0,52,4800,37,46,7775
179,2,122.0,volkswagen,gas,std,two,sedan,fwd,front,97.3,...,109,mpfi,3.19,3.4,9.0,85,5250,27,34,7975

In [139]:
doors = automobile_df['num-of-doors'] == 'four'
print('Per la maggior parte delle berline a 4 porte, aspiration è \'std\'')
automobile_df[ sedan & doors ].groupby('aspiration').count()

Per la maggior parte delle berline a 4 porte, aspiration è 'turbo'

,symboling,normalized-losses,make,fuel-type,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,length,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
aspiration,,,,,,,,,,,,,,,,,,,,,
std,61,52,61,61,61,61,61,61,61,61,...,61,61,61,61,61,61,61,61,61,61
turbo,18,17,18,18,18,18,18,18,18,18,...,18,18,18,18,18,18,18,18,18,18

In [140]:
aspiration_std_flt = automobile_df['aspiration'] == 'std'
aspiration_turbo_flt = automobile_df['aspiration'] == 'turbo'
num_doors_null_flt = automobile_df['num-of-doors'].isnull()
flt_index = automobile_df[ (aspiration_std_flt | aspiration_turbo_flt) & num_doors_null_flt]['num-of-doors'].index

automobile_df.loc[ flt_index, 'num-of-doors'] = automobile_df.loc[ flt_index, 'num-of-doors'].replace(np.nan, '2')

# Esercizio 7
Abbiamo il seguente DataFrame che raccoglie le misurazioni di un sensore che misura la temperatura atmosferica giornaliera: 

```python
import numpy as np, pandas as pd
temp = pd.DataFrame({"Giorno": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], "Temperature": [18, 19, 18, np.nan, 21, 20, 20, np.nan, 21, 23, np.nan, 23, 24]})
```
- Il sensore a volte non funziona, dunque alcuni dati sono mancanti: quale sarebbe la migliore strategia per gestirli?

In [197]:
temp = pd.DataFrame({"Giorno": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], "Temperature": [18, 19, 18, np.nan, 21, 20, 20, np.nan, 21, 23, np.nan, 23, 24]})

display(temp)
display(temp.interpolate())

    Giorno  Temperature
0        0         18.0
1        1         19.0
2        2         18.0
3        3          NaN
4        4         21.0
5        5         20.0
6        6         20.0
7        7          NaN
8        8         21.0
9        9         23.0
10      10          NaN
11      11         23.0
12      12         24.0

    Giorno  Temperature
0        0         18.0
1        1         19.0
2        2         18.0
3        3         19.5
4        4         21.0
5        5         20.0
6        6         20.0
7        7         20.5
8        8         21.0
9        9         23.0
10      10         23.0
11      11         23.0
12      12         24.0

# Esercizio 8 1/2 
Nel pacchetto os della standard library c'è la funzione os.listdir() che permette di avere la lista dei nomi di file all'interno di una directory; senza input di default li cerca nella directory di lavoro corrente, altrimenti si può passare un path per esaminare una directory specifica, ad esempio os.listdir("mio_progetto/beginner_datasets/") 
- Nella directory dei beginner_datasets, quali sono i dataset che contengono dati nulli?

1. Dovremo usare un ciclo for per esaminare tutti i nomi dei file
2. Dovremo selezionare solo i nomi di file con estensione .csv (quindi usare un costrutto if)
3. Nel corpo dovremo leggere di volta in volta il file in esame, e caricarlo in un DataFrame con la funzione .read_csv()
4. Sul DataFrame dovremo utilizzare il metodo .isna() per trovare la maschera booleana dei dati nulli
5. Dovremo contare i dati nulli, utilizzando .sum(); potremmo doverlo utilizzare più di una volta
6. Dovremo stampare, o memorizzare in una list, solo i nomi dei file che contengono dati nulli

In [198]:
datasets_path = parent_folder + '\\datasets\\beginner_datasets\\'
for dataset in os.listdir(datasets_path):
    df_path = datasets_path + dataset
    if 'csv' in dataset:
        df = pd.read_csv(df_path)
    elif 'xlsx' in dataset:
        df = pd.read_excel(df_path)
    df_tot_null = df.isnull().sum().sum()
    if df_tot_null > 0:    
        # \033[41m colore sfondo rosso
        print(f'\033[41m Dataset Name: {dataset.upper():21}\tnull data: {df_tot_null:6d} ')
# setto di nuovo il colore bianco
print('\033[0m')

 Dataset Name: AUTOMOBILE.CSV       	null data:     39
 Dataset Name: ELECTIONS.CSV        	null data:     52
 Dataset Name: FRANCE.CSV           	null data:     66
 Dataset Name: HEPATITIS.CSV        	null data:    153
 Dataset Name: HOUSE.CSV            	null data:   7829
 Dataset Name: INCOME.CSV           	null data:   4262
 Dataset Name: MICE.CSV             	null data:   1396
 Dataset Name: NBA.CSV              	null data:     11
 Dataset Name: POKEMON.CSV          	null data:    386
 Dataset Name: POPULATION.CSV       	null data:     12
 Dataset Name: PYCARET_DATASETS.XLSX	null data:     14
 Dataset Name: SEEDS.CSV            	null data:      4
 Dataset Name: TRAFFIC.CSV          	null data:  48143
 Dataset Name: WIKIPEDIA.CSV        	null data:     68